Revit 2024 API
Space.ClosedShell Property
Return the closedShell of the space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public GeometryElement ClosedShell { get; }
Visual Basic
Public ReadOnly Property ClosedShell As GeometryElement
	Get
Visual C++
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace